# Concat

In [1]:
import numpy as np
import pandas as pd

In [2]:
# https://pandas.pydata.org/docs/user_guide/merging.html

In [5]:
a = pd.read_csv('a.csv')

In [7]:
b= pd.read_csv('b.csv')

In [8]:
a

    A   B
0  10  20
1  30  40

In [9]:
b

    A   C
0  10  20
1  30  40

In [10]:
pd.concat([a,b]) #simple stacking , not an intelligent method , one-below other stacking

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [11]:
pd.concat([a,b],axis=0) #dfault axis is zero

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [12]:
pd.concat([a,b],axis=1) #we get duplicate columns , side-by-side stacking

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [13]:
# accessing the dataframe after concat operation

In [14]:
data =  pd.concat([a,b],axis=1)

In [15]:
data

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [16]:
data.shape

(2, 4)

In [17]:
data.iloc[:,3]

0    20
1    40
Name: C, dtype: int64

In [18]:
data.loc[:,'C']

0    20
1    40
Name: C, dtype: int64

In [19]:
pd.concat([a,b] ,axis=0,join='outer') #will get all the columns , this is case of UNION

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [20]:
pd.concat([a,b] ,axis=0,join='inner') #will get only thecommon columns , this is case of INTERSECTION

    A
0  10
1  30
0  10
1  30